In [1]:
import pandas as pd
import mysql.connector

#connect to mysql
conn = mysql.connector.connect(
        host = 'localhost',
    user = 'root',
    password = 'welcomeJAMES123',
        database= 'db_librarymanagement')

cursor = conn.cursor()

In [26]:
df = pd.read_excel("publisher_values.xlsx",header = None)

In [30]:
df.head()

,0,1,2,3
0,NaN,DAW Books,"375 Hudson Street, New York, NY 10014",212-366-2000
1,NaN,Viking,"375 Hudson Street, New York, NY 10014",212-366-2000
2,NaN,Signet Books,"375 Hudson Street, New York, NY 10014",212-366-2000
3,NaN,Chilton Books,Not Available,Not Available
4,NaN,George Allen & Unwin,"83 Alexander Ln, Crows Nest NSW 2065, Australia",+61-2-8425-100

In [31]:
df=df.drop(0,axis=1)
df.head()

,1,2,3
0,DAW Books,"375 Hudson Street, New York, NY 10014",212-366-2000
1,Viking,"375 Hudson Street, New York, NY 10014",212-366-2000
2,Signet Books,"375 Hudson Street, New York, NY 10014",212-366-2000
3,Chilton Books,Not Available,Not Available
4,George Allen & Unwin,"83 Alexander Ln, Crows Nest NSW 2065, Australia",+61-2-8425-100

In [32]:
for _,row in df.iterrows():
    sql= "INSERT INTO tbl_publisher (publisher_PublisherName, publisher_PublisherAddress, publisher_PublisherPhone) VALUES (%s,%s,%s)"
    cursor.execute(sql,tuple(row))

In [33]:
# COMMIT AND CLOSE THE CONNECTION
conn.commit()
cursor.close()
conn.close()